app/views/users/show.html.erb

<h2>books</h2>
<% @user.books.each do |book| %>
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1