app/controllers/adds_controller.rb

  def index
    @adds = Add.all
---
SELECT `adds`.* FROM `adds`

  def create
    @user = User.find(params[:user_id])
    @add = @user.adds.create(params.require(:add).permit(:title, :description))
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `adds` (`title`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('wqeqwe', 'wqeqwe', 1, '2016-02-05 23:30:23', '2016-02-05 23:30:23')

  def destroy
    @add.destroy
---
DELETE FROM `adds` WHERE `adds`.`id` = 1

    def set_add
      @add = Add.find(params[:id])
---
SELECT  `adds`.* FROM `adds` WHERE `adds`.`id` = 7 LIMIT 1