app/controllers/books_controller.rb

  def create
    @ad = Ad.new()
    @ad.title = params[:ad][:title]
    @ad.description = params[:ad][:description]
    @ad.price = params[:ad][:price]
    @ad.user = current_user
    @ad.book = @book = Book.new()
    @ad.attachment = params[:book][:attachment]

    @book.ad = @ad
    @book.ISBN = params[:book][:ISBN]

    @ad.save
---
INSERT INTO `books` (`title`, `description`, `isbn`, `created_at`, `updated_at`) VALUES ('1864', 'a book about the futur', '94029348203948032', '2016-01-27 22:10:14', '2016-01-27 22:10:14')