app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'vincpel@gmail.com'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def create
    @user = User.find_by_email(params[:email])