app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    authorize @user
    if @user.update_attributes(secure_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `password_hash` = '$2a$10$yEVPK/fHnaEfqzf4Xm8Kj.BdU6Ek5u5xf0o5WsMfIXxKQR5.7/YVm', `email` = 'vincpel@gmail.com', `updated_at` = '2016-01-30 03:48:36' WHERE `users`.`id` = 4

  def destroy
    user = User.find(params[:id])
    authorize user
    user.destroy
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 1

  def create
    @user = User.new(params[:user])
    @user.email = params[:email]
    @user.password = params[:password]
    @user.save!
---
INSERT INTO `users` (`email`, `password_hash`, `created_at`, `updated_at`) VALUES ('vincpel@gmail.com', '$2a$10$WKybA68XrxKqrB5Evvij3uMjleDYMJL9WMm5M2JpV4qPo4mQmA9I.', '2016-02-01 03:28:20', '2016-02-01 03:28:20')